###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ce-epo3-cad.ewi.tudelft.nl)
#  Generated on:      Thu Dec  8 15:37:44 2022
#  Design:            driver
#  Command:           saveDesign ../out/driver.enc
###############################################################
current_design driver
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 30.000000 -waveform {0.000000 15.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {enable}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {enable}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {enable}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {enable}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {reset}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {spc_clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {spc_clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {spc_clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {spc_clk}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {{edge}}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {{edge}}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {{edge}}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {{edge}}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {high_edge}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {high_edge}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {high_edge}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {high_edge}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[15]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[15]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[15]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[15]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[14]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[14]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[14]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[14]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[13]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[13]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[13]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[13]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[12]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[12]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[12]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[12]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[11]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[11]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[11]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[11]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[10]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[10]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[10]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[10]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[9]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[9]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[9]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[9]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[8]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[8]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[8]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[8]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdi_in[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdi_in[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdi_in[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdi_in[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -min -pin ZN [get_ports {sdo}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -min -pin ZN [get_ports {sdo}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -rise -max -pin ZN [get_ports {sdo}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -fall -max -pin ZN [get_ports {sdo}]
set_load -pin_load -max  1  [get_ports {sdi}]
set_load -pin_load -min  1  [get_ports {sdi}]
set_load -pin_load -max  1  [get_ports {spc}]
set_load -pin_load -min  1  [get_ports {spc}]
set_load -pin_load -max  1  [get_ports {cs}]
set_load -pin_load -min  1  [get_ports {cs}]
set_load -pin_load -max  1  [get_ports {cycle[2]}]
set_load -pin_load -min  1  [get_ports {cycle[2]}]
set_load -pin_load -max  1  [get_ports {cycle[1]}]
set_load -pin_load -min  1  [get_ports {cycle[1]}]
set_load -pin_load -max  1  [get_ports {cycle[0]}]
set_load -pin_load -min  1  [get_ports {cycle[0]}]
set_load -pin_load -max  1  [get_ports {gyro_data[7]}]
set_load -pin_load -min  1  [get_ports {gyro_data[7]}]
set_load -pin_load -max  1  [get_ports {gyro_data[6]}]
set_load -pin_load -min  1  [get_ports {gyro_data[6]}]
set_load -pin_load -max  1  [get_ports {gyro_data[5]}]
set_load -pin_load -min  1  [get_ports {gyro_data[5]}]
set_load -pin_load -max  1  [get_ports {gyro_data[4]}]
set_load -pin_load -min  1  [get_ports {gyro_data[4]}]
set_load -pin_load -max  1  [get_ports {gyro_data[3]}]
set_load -pin_load -min  1  [get_ports {gyro_data[3]}]
set_load -pin_load -max  1  [get_ports {gyro_data[2]}]
set_load -pin_load -min  1  [get_ports {gyro_data[2]}]
set_load -pin_load -max  1  [get_ports {gyro_data[1]}]
set_load -pin_load -min  1  [get_ports {gyro_data[1]}]
set_load -pin_load -max  1  [get_ports {gyro_data[0]}]
set_load -pin_load -min  1  [get_ports {gyro_data[0]}]
set_load -pin_load -max  1  [get_ports {data_ready}]
set_load -pin_load -min  1  [get_ports {data_ready}]
set_load -pin_load -max  1  [get_ports {prev_spc_clk}]
set_load -pin_load -min  1  [get_ports {prev_spc_clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {enable}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {{edge}}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdi_in[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {high_edge}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {spc_clk}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk}] [get_ports {sdo}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[6]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[4]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cycle[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {data_ready}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[7]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {prev_spc_clk}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[5]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[3]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cycle[2]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {gyro_data[1]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cycle[0]}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {cs}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {spc}]
set_output_delay -add_delay 0.5 -clock [get_clocks {clk}] [get_ports {sdi}]
